# IFCFileReadOptions Properties

---
The IFCFileReadOptions type exposes the following members.
| Name| Description
---|---|---
| FileName|  The full file name of the IFC file to be read.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| XMLConfigFileName|  The XML configuration file name. It is used only for reading IFC-XML format file.
Top
#### Reference
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace